In [2]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("Original data:\n")
df=pd.read_excel("Marks.xlsx")
print(df)

Original data:

    Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  social  Total
0            0    1        Abu       90     78     97       66      87    418
1            1    2        adu       89     78     87       76      90    420
2            2    3       badu       76     26     75       38      76    291
3            3    4        udu       89     78     88       36      98    389
4            4    5       dadu       58     56     57       37      91    299
5            5    6       raju       78     89     74       37      92    370
6           10   11       lijo       77     85     94       78      81    415
7           11   12       rika       90     91     55       65      86    387
8           12   13      touka       91     73     81       87      87    419
9           13   14     sasuke       73     65     89       77      90    394
10          14   15     naruto       89     62     67       74      89    381
11          15   16    kakashi       78     77     55       88      65    363
12          16   17   zabimaru       58     73     56       99      62    348
13          17   18     itachi       88     78     57       33      53    309
14          18   19       tobi       99     88     85       36      63    371
15          19   20  maithresh       47     38     58       84      77    304

In [4]:
f=df['Name'].str.strip()
f.to_excel("Marks 2.xlsx")
print(f)

0           Abu
1           adu
2          badu
3           udu
4          dadu
5          raju
6          lijo
7          rika
8         touka
9        sasuke
10       naruto
11      kakashi
12     zabimaru
13       itachi
14         tobi
15    maithresh
Name: Name, dtype: object

In [6]:
print("\nReplaceValue:")
k=df.fillna(method='pad')
print(k)
print("\n updated list\n")
k.to_excel("Marks 2.xlsx")

ReplaceValue:
    Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  social  Total
0            0    1        Abu       90     78     97       66      87    418
1            1    2        adu       89     78     87       76      90    420
2            2    3       badu       76     26     75       38      76    291
3            3    4        udu       89     78     88       36      98    389
4            4    5       dadu       58     56     57       37      91    299
5            5    6       raju       78     89     74       37      92    370
6           10   11       lijo       77     85     94       78      81    415
7           11   12       rika       90     91     55       65      86    387
8           12   13      touka       91     73     81       87      87    419
9           13   14     sasuke       73     65     89       77      90    394
10          14   15     naruto       89     62     67       74      89    381
11          15   16    kakashi       78     77     55       88      65    363
12          16   17   zabimaru       58     73     56       99      62    348
13          17   18     itachi       88     78     57       33      53    309
14          18   19       tobi       99     88     85       36      63    371
15          19   20  maithresh       47     38     58       84      77    304

 updated list

/var/folders/nl/brxzfx2n54v8ksfjs_dvrn0h0000gp/T/ipykernel_2835/716342018.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  k=df.fillna(method='pad')

In [8]:
print("\n Drop One particular Column and its VAlue:\n")
k.drop(['social'],axis=1,inplace=True)
print(k)
print("\n Updated list\n")
k.to_excel("Marks 2.xlsx")

 Drop One particular Column and its VAlue:

    Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  Total
0            0    1        Abu       90     78     97       66    418
1            1    2        adu       89     78     87       76    420
2            2    3       badu       76     26     75       38    291
3            3    4        udu       89     78     88       36    389
4            4    5       dadu       58     56     57       37    299
5            5    6       raju       78     89     74       37    370
6           10   11       lijo       77     85     94       78    415
7           11   12       rika       90     91     55       65    387
8           12   13      touka       91     73     81       87    419
9           13   14     sasuke       73     65     89       77    394
10          14   15     naruto       89     62     67       74    381
11          15   16    kakashi       78     77     55       88    363
12          16   17   zabimaru       58     73     56       99    348
13          17   18     itachi       88     78     57       33    309
14          18   19       tobi       99     88     85       36    371
15          19   20  maithresh       47     38     58       84    304

 Updated list

In [10]:
print("\n Drop NaNrows:\n")
df=pd.read_excel("Marks.xlsx")
print(df)
x=df.dropna()
print(x)
print("\n Updated list:\n")
x.to_excel("Marks.xlsx")

 Drop NaNrows:

    Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  social  Total
0            0    1        Abu       90     78     97       66      87    418
1            1    2        adu       89     78     87       76      90    420
2            2    3       badu       76     26     75       38      76    291
3            3    4        udu       89     78     88       36      98    389
4            4    5       dadu       58     56     57       37      91    299
5            5    6       raju       78     89     74       37      92    370
6           10   11       lijo       77     85     94       78      81    415
7           11   12       rika       90     91     55       65      86    387
8           12   13      touka       91     73     81       87      87    419
9           13   14     sasuke       73     65     89       77      90    394
10          14   15     naruto       89     62     67       74      89    381
11          15   16    kakashi       78     77     55       88      65    363
12          16   17   zabimaru       58     73     56       99      62    348
13          17   18     itachi       88     78     57       33      53    309
14          18   19       tobi       99     88     85       36      63    371
15          19   20  maithresh       47     38     58       84      77    304
    Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  social  Total
0            0    1        Abu       90     78     97       66      87    418
1            1    2        adu       89     78     87       76      90    420
2            2    3       badu       76     26     75       38      76    291
3            3    4        udu       89     78     88       36      98    389
4            4    5       dadu       58     56     57       37      91    299
5            5    6       raju       78     89     74       37      92    370
6           10   11       lijo       77     85     94       78      81    415
7           11   12       rika       90     91     55       65      86    387
8           12   13      touka       91     73     81       87      87    419
9           13   14     sasuke       73     65     89       77      90    394
10          14   15     naruto       89     62     67       74      89    381
11          15   16    kakashi       78     77     55       88      65    363
12          16   17   zabimaru       58     73     56       99      62    348
13          17   18     itachi       88     78     57       33      53    309
14          18   19       tobi       99     88     85       36      63    371
15          19   20  maithresh       47     38     58       84      77    304

 Updated list:

In [22]:
print("\n Replace Values:\n")
n=pd.read_excel("Marks.xlsx")
print("\n Original data:\n")
print(n)
y=n.replace({89:88})
print("\n Replaced Datasheet\n")
print(y)
print("\n Updated Datasheet:\n")
y.to_excel("Marks 2.xlsx")

 Replace Values:


 Original data:

    Unnamed: 0.1  Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  \
0              0           0    1        Abu       90     78     97       66
1              1           1    2        adu       89     78     87       76
2              2           2    3       badu       76     26     75       38
3              3           3    4        udu       89     78     88       36
4              4           4    5       dadu       58     56     57       37
5              5           5    6       raju       78     89     74       37
6              6          10   11       lijo       77     85     94       78
7              7          11   12       rika       90     91     55       65
8              8          12   13      touka       91     73     81       87
9              9          13   14     sasuke       73     65     89       77
10            10          14   15     naruto       89     62     67       74
11            11          15   16    kakashi       78     77     55       88
12            12          16   17   zabimaru       58     73     56       99
13            13          17   18     itachi       88     78     57       33
14            14          18   19       tobi       99     88     85       36
15            15          19   20  maithresh       47     38     58       84

    social  Total
0       87    418
1       90    420
2       76    291
3       98    389
4       91    299
5       92    370
6       81    415
7       86    387
8       87    419
9       90    394
10      89    381
11      65    363
12      62    348
13      53    309
14      63    371
15      77    304

 Replaced Datasheet

    Unnamed: 0.1  Unnamed: 0  Sno       Name  English  Tamil  Maths  Science  \
0              0           0    1        Abu       90     78     97       66
1              1           1    2        adu       88     78     87       76
2              2           2    3       badu       76     26     75       38
3              3           3    4        udu       88     78     88       36
4              4           4    5       dadu       58     56     57       37
5              5           5    6       raju       78     88     74       37
6              6          10   11       lijo       77     85     94       78
7              7          11   12       rika       90     91     55       65
8              8          12   13      touka       91     73     81       87
9              9          13   14     sasuke       73     65     88       77
10            10          14   15     naruto       88     62     67       74
11            11          15   16    kakashi       78     77     55       88
12            12          16   17   zabimaru       58     73     56       99
13            13          17   18     itachi       88     78     57       33
14            14          18   19       tobi       99     88     85       36
15            15          19   20  maithresh       47     38     58       84

    social  Total
0       87    418
1       90    420
2       76    291
3       98    389
4       91    299
5       92    370
6       81    415
7       86    387
8       87    419
9       90    394
10      88    381
11      65    363
12      62    348
13      53    309
14      63    371
15      77    304

 Updated Datasheet:

In [30]:
df=pd.read_excel("Marks 2.xlsx")
print(df)
print("\n Extracting isin()function:\n")
new=df['Science'].isin([37])
print(df[new])

    Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  Sno       Name  ...  Tamil  Maths  \
0              0             0           0    1        Abu  ...     78     97
1              1             1           1    2        adu  ...     78     87
2              2             2           2    3       badu  ...     26     75
3              3             3           3    4        udu  ...     78     88
4              4             4           4    5       dadu  ...     56     57
5              5             5           5    6       raju  ...     88     74
6              6             6          10   11       lijo  ...     85     94
7              7             7          11   12       rika  ...     91     55
8              8             8          12   13      touka  ...     73     81
9              9             9          13   14     sasuke  ...     65     88
10            10            10          14   15     naruto  ...     62     67
11            11            11          15   16    kakashi  ...     77     55
12            12            12          16   17   zabimaru  ...     73     56
13            13            13          17   18     itachi  ...     78     57
14            14            14          18   19       tobi  ...     88     85
15            15            15          19   20  maithresh  ...     38     58

    Science  social  Total
0        66      87    418
1        76      90    420
2        38      76    291
3        36      98    389
4        37      91    299
5        37      92    370
6        78      81    415
7        65      86    387
8        87      87    419
9        77      90    394
10       74      88    381
11       88      65    363
12       99      62    348
13       33      53    309
14       36      63    371
15       84      77    304

[16 rows x 11 columns]

 Extracting isin()function:

   Unnamed: 0.2  Unnamed: 0.1  Unnamed: 0  Sno  Name  ...  Tamil  Maths  \
4             4             4           4    5  dadu  ...     56     57
5             5             5           5    6  raju  ...     88     74

   Science  social  Total
4       37      91    299
5       37      92    370

[2 rows x 11 columns]